#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "9c02e9eb-e774-4a31-8e43-3e54a54ea88f"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_STG/SECONDARY_SOURCE"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "f692dc45-2411-41f7-ac95-da948714f1a7"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/SECONDARY_SOURCE"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "7da1617b-2d92-4c2c-8981-dd7151a76a85"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/SECONDARY_SOURCE"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "c0fe2e9f-6937-4ffa-9296-d786d9b0a98b"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "SECONDARY_SOURCE"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_FLVR/SECONDARY_SOURCE"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "ab63ae34-0fda-4f1b-ac8f-1380bea87f44"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "SECONDARY_SOURCE"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/SECONDARY_SOURCE"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "a837283e-f96e-446d-9c51-5ac7d0eab773"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "SECONDARY_SOURCE"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/SECONDARY_SOURCE"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "20e896f4-bf43-43ed-9441-d166e0513f34"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "SECONDARY_SOURCE"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/SECONDARY_SOURCE"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "1197df69-9199-49a5-a49a-c7d43d35551c"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "SECONDARY_SOURCE"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_STG/SECONDARY_SOURCE"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2e161683-3c4d-4a2a-a86b-c83f2fe3e3d7"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "SECONDARY_SOURCE"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/SECONDARY_SOURCE"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "045f3224-9637-4785-a661-fc6f028804d2"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "SECONDARY_SOURCE"
      + service_account_user_id = (known after apply)
    }

Plan: 17 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*